РасчетныеЗадачиЗанятие3/src/Documents/БольничныйЛист/БольничныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БольничныйЛист</name>
  <registerRecords>InformationRegister.СостояниеСотрудников</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыплаты</name>
    <type>
      <types>EnumRef.ПроцентыВыплатыБольничного</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>DefinedType.ПоложительноеЧисло</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДней</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.КоличествоВремени</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие3/src/InformationRegisters/СостояниеСотрудников/СостояниеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеСотрудников</name>
  <comment>Сведения о сотрудниках</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияФизическогоЛица</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РасчетныеЗадачиЗанятие3/src/Enums/СостоянияФизическогоЛица/СостоянияФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияФизическогоЛица</name>
  <comment>Состояния физического лица</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
  <enumValues>
    <name>Болеет</name>
  </enumValues>
</mdclass:Enum>

РасчетныеЗадачиЗанятие3/src/Documents/БольничныйЛист/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СостояниеСотрудников.Записывать = Истина;
	
	Движение = Движения.СостояниеСотрудников.Добавить();
	Движение.Период = ДатаНачала;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Болеет;
	Движение.ГрафикРаботы = ГрафикРаботы;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
	Движение.Комментарий = "Начало периода болезни";
	
	Движение = Движения.СостояниеСотрудников.Добавить();
	Движение.Период = ДатаОкончания;
	Движение.ФизическоеЛицо = ФизическоеЛицо;
	Движение.Состояние = Перечисления.СостоянияФизическогоЛица.Работает;
	Движение.ГрафикРаботы = ГрафикРаботы;
	Движение.Должность = Должность;
	Движение.Подразделение = Подразделение;
	Движение.Комментарий = "Окончание периода болезни";
	
КонецПроцедуры
